/*/////////////////////////////////////////////////////////////////////////////////////
課題C17．for文を使って、'-'と'*'を下記のように逆三角形に並べるプログラムを作成しなさい。
        文字は一つずつ出力し、文字と改行を同時に出力しないこと。
**********
-*********
--********
---*******
----******
-----*****
------****
-------***
--------**
---------*

キーワード：for文，二重ループ

最終更新日：2015.04.01
*/
#define _CRT_SECURE_NO_WARNINGS  // 余計な警告が出ないようにする
#include	<stdio.h>

int	main( void )
{
	int	i, j;
	int h;
	for(i=0;i<10;i++){
		for(h=0;h<i;h++){
			printf("-");
		}
		for(j=10;j>i;j--){
			printf("*");
		}
		printf("\n");
	}

	return 0;
}
